public class Task04 {
    /*
    Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен
ред
     */
    public static void main(String[] args) {

        for (int i = 10; i >= 1; i--) {
            System.out.println(i);
        }

    }
}