public class Task03 {
    /*
    Задача 3: Да се изведат на екрана всички нечетни числа от -10
до 10
     */
    public static void main(String[] args) {

        for (int i = -9; i <= 10; i += 2) {
            System.out.println(i);
        }

    }
}